/*
 * bsp_uart.c
 *
 *  Created on: 2019年5月28日
 *      Author: xuz
 */
#include "bsp_uart.h"

/************************************************************************************************
 *  说	明 : UART相关引脚初始化
 *  参	数 : 无
 *  返回值  : 无
************************************************************************************************/
void Uart_GPIO_Config(void)
{
	//TXD(1.4)
	P1SEL0 |= UART_TXD_PIN;
	P1SEL1 &=~ UART_TXD_PIN;		//功能复用

	//RXD(1.5)
	P1SEL0 |= UART_RXD_PIN;
	P1SEL1 &=~ UART_RXD_PIN;		//功能复用
}


/************************************************************************************************
 *  说	明 : UART相关寄存器初始化
 *  参	数 : 无
 *  返回值  : 无
************************************************************************************************/
void Uart_REG_Config(void)
{
	UCA0CTLW0 |= 0x0080;
	UCA0BRW = 0x08;		//clockPrescalar
	UCA0MCTLW = 0xD600;	//这两行用于配置波特率
}


/************************************************************************************************
 *  说	明 : UART初始化,按照手册上配置要求顺序配置
 *  参	数 : 无
 *  返回值  : 无
************************************************************************************************/
void UART_Init(void)
{
	UCA0CTLW0 |= UCSWRST;
	Uart_REG_Config();
	Uart_GPIO_Config();
	UCA0CTLW0 &=~ UCSWRST;
}


/************************************************************************************************
 *  说	明 : UART数据发送函数
 *  参	数 : data:要发送的舒适
 *  返回值  : 无
************************************************************************************************/
void Uart_Send(uint16_t data)
{
	 UCA0TXBUF = data;
}
