/*
 * bsp_spi.c
 *
 *  Created on: 2018年11月30日
 *      Author: xu
 *      SPI初始化配置			【复用功能通过datasheet里查找】
 *
 *
 *      		硬件说明:
 *      		 	EUSCI_B1_SPI:
 *      						SPI_CLK  --> P1.2
* 					  		    SPI_CS   --> P1.3
* 					  			SPI_MOSI --> P1.0
* 					  			SPI_MISO --> P1.1
 *
 *      			EUSCI_A0_SPI:
 *      						SPI_CLK  --> P2.2
* 					  		    SPI_CS   --> P2.3
* 					  			SPI_MOSI --> P1.2
* 					  			SPI_MISO --> P1.3
*
*
* 					本套代码使用的是EUSCI_B1_SPI
 */

#include "bsp_spi.h"

/************************************************************************************************
 *  说	明 : SPI相关引脚初始化
 *  参	数 : 无
 *  返回值  : 无
************************************************************************************************/
void SPI_GPIO_Config(void)
{
	//CLK(1.1)
//	P1DIR |= SPI_CLK_PIN;	//设置时钟引脚为输出方向...手册上说可以不用配置方向
	P1SEL0 |= SPI_CLK_PIN;
	P1SEL1 &=~ SPI_CLK_PIN;		//功能复用

	//MOSI(1.2)
//	P1DIR |= SPI_MOSI_PIN;	//设置主机输出从机输入引脚为输出方向...手册上说可以不用配置方向
	P1SEL0 |=  SPI_MOSI_PIN;
	P1SEL1 &=~ SPI_MOSI_PIN;		//功能复用

	//MISO(1.3)
//	P1DIR |= SPI_MISO_PIN;	//设置主机输入从机输出引脚为输入方向...手册上说可以不用配置方向;
	P1SEL0 |=  SPI_MISO_PIN;
	P1SEL1 &=~ SPI_MISO_PIN;		//功能复用
}


/************************************************************************************************
 *  说	明 : SPI片选引脚输出高电平(P1.0)
 *  参	数 : 无
 *  返回值  : 无
************************************************************************************************/
void SPI_CS_HIGH(void)
{
	P1DIR |= SPI_CS_PIN;	//配置为输出方向
	P1OUT |= SPI_CS_PIN;	//输出高电平
}


/*
 *  说	明 : SPI片选引脚输出低电平
 *  参	数 : 无
 *  返回值  : 无
************************************************************************************************/
void SPI_CS_LOW(void)
{
	P1DIR |=  SPI_CS_PIN;	//配置为输出方向
	P1OUT &=~ SPI_CS_PIN;	//输出低电平
}


/************************************************************************************************
 *  说	明 : SPI寄存器初始化配置
 *  参	数 : 无
 *  返回值  : 无
************************************************************************************************/
void SPI_Init_Config(void)
{
	UCB0BR0 = 0x01;
	UCB0BR1 = 0x00;			//传输速率配置

	UCB0CTL0 |= 0xAD;
	UCB0CTL1 = 0x82;		//SPI初始化寄存器配置，注：此寄存器配置完成后已经清零了，不需要再次配置位UCSWRST
}


/************************************************************************************************
 *  说	明 : SPI始化配置(严格按照手册上说明的配置步骤，请参照手册说明)
 *  参	数 : 无
 *  返回值  : 无
************************************************************************************************/
void SPI_Init(void)
{
//	UCB0CTLW0 |= UCSWRST;
	SPI_Init_Config();
	SPI_GPIO_Config();
//	UCB0CTLW0 &=~ UCSWRST;

	//打开发送和接收中断
	UCB0IE |= UCTXIE;
//	UCB0IE |= UCRXIE;
}


/************************************************************************************************
 *  说	明 : SPI发送一个字节函数
 *  参	数 : 要发送的数据
 *  返回值  : 接收到的数据
************************************************************************************************/
uint8_t SPI_Send(uint8_t data)
{
	uint8_t receive_data = 0x00;	//定义一个变量作为接收数据缓存区

	UCB0TXBUF = data;	//将数据写入发送缓存区
	__bis_SR_register(LPM0_bits + GIE);	//进入低功耗模式0

	receive_data = UCB0RXBUF;		//读取收到的数据

	return receive_data;
}
/***************************************************中断方式处理******************************************************************/

/************************************************************************************************
 *  说	明 : SPI发送一个字节函数
 *  参	数 : 要发送的数据
 *  返回值  : 无
************************************************************************************************/

/*void SPI_Send(uint8_t data)
{
	UCB0TXBUF = data;
	__bis_SR_register(LPM3_bits + GIE);
}*/


/************************************************************************************************
 *  说	明 : 中断服务函数
************************************************************************************************/
#pragma vector = USCI_B0_VECTOR
__interrupt void USCI_B0_ISR(void)
{
	switch(__even_in_range(UCB0IV,4))
	{
		case 0:		//无中断
			break;
		case 2:		//接收中断
			break;
		case 4:		//发送中断
			__bic_SR_register_on_exit(LPM0_bits);	//退出低功耗模式
			break;
		default :
			break;
	}
}




